# Section 6: Python for Data Analysis - Pandas

# Data Input and Output

In [1]:
##Pandas has the ability to read and write data from a great variety of sources, In this lecture we are going to be 
##focused with four main data sources: 

##CSV
##Excel
##HTML 
##SQL 

import pandas as pd

In [19]:
pwd

'/home/vick/Python Projects/Python_DS_ML_Bootcamp/Python_DS_ML_Solutions/03-Pandas'

In [20]:
## 1 - Reading and writing csv files 
pd.read_csv('Data/example')  ##To read any files we use the read_ command

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [21]:
## Pandas can read from many formats! 

df = pd.read_csv('Data/example')

In [22]:
##If we want to write off of a data fram we use the ._to method

df.to_csv('Data/My_output', index = False)

In [24]:
pd.read_csv('Data/My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [25]:
### We need to specify index = False to drop the index from the file we are writing from 

##If we don't set Index to false notice what happens:

df.to_csv('Data/with_index')

In [27]:
dr = pd.read_csv('Data/with_index') ##We saved the previous index as a column!

In [45]:
dr

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [48]:
dr.drop('Unnamed: 0', axis = 1, inplace = True)

In [51]:
dr

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [64]:
### 2 - REading and Writing Excel files -> Keep in mind that Pandas cannot import formulas, images or macros. 
### USing the read_excel method with these kind of objects may cause Pandas to crash 

##An excel workbook has sheets for which pandas thinks each sheet is a data Frame
df =pd.read_excel('Data/Excel_Sample.xlsx', sheet_name='Sheet1', index_col=0) ##index_col = 0 - avoids extra index column

In [65]:
##Lets write to a new excel File 
df.to_excel('Data/writeExcel.xlsx', sheet_name = 'mySheet') ##Nice!!

In [66]:
### 3 - Reading from an HTML file 

##Lets read from an HTML link 

data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [67]:
type(data) ##This will not directly read a Data Frame but a list.

list

In [71]:
### Pandas tries to find every table elements/references in this html file. Each item in the list is a Data Frame.

data[0] ##First item is usually the imen we are looking for

data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"

In [72]:
### 4 - Reading from SQL 

## Pandas is probably not the best way to read a sql data base - Many flavors of sql 
## We are going to build a simple sql engine temporarily held in memory in order to show how we can read sql tables 
## as Data Frames with Pandas.

## Look for your drivers depending with the sql flavor you are working with. 

from sqlalchemy import create_engine

In [73]:
engine = create_engine('sqlite:///:memory:') ##Creates a temporary sql lite engine in memory.

In [74]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [77]:
##Writing a sql table 

df.to_sql('my_table2', engine) ##engine -> connection

In [79]:
sqldf = pd.read_sql('my_table', con = engine) ##Pandas is not the best way to do this!

In [80]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15